Summer_2021/Python_115/README.org
#+TITLE: Python 115 Class Notes
#+AUTHOR: Matthew Yackiel
#+PROPERTY: header-args mkdirp yes :eval none

* Table of Contents :toc:
- [[#module][Module]]
  - [[#hello-world][Hello World!]]
  - [[#interactive-terminal][Interactive Terminal]]
  - [[#back-to-the-file][Back to the file]]
  - [[#executing-from-a-text-editor][Executing from a text editor]]
  - [[#some-exercises-with-pycharm][Some exercises with Pycharm]]
  - [[#comments][Comments]]
  - [[#variables][Variables]]
  - [[#errors][Errors]]
  - [[#input][Input]]
  - [[#module-1-practice-exercises][Module 1 Practice Exercises]]
- [[#module-2--data-types][Module 2 : Data Types]]
  - [[#identify-data-types][Identify Data Types]]
  - [[#numeric-types][Numeric Types]]
  - [[#strings][Strings]]
  - [[#logical-operators][Logical Operators]]
  - [[#practice-exercise][Practice Exercise]]
- [[#module-3-control-statements][Module 3: Control Statements]]
  - [[#if-statements][If Statements]]
  - [[#iteration][Iteration]]
  - [[#iteration-continued][Iteration Continued]]
- [[#module-4-functions][Module 4: Functions]]
  - [[#what-is-a-funciton][What is a funciton?]]
  - [[#passing-arguments][Passing Arguments]]
  - [[#exercises][Exercises]]

* Module
:PROPERTIES:
:header-args: :tangle ./Module_1/Lectures.py
:END:
** Hello World!
The following code blocks illustrate the evolution of test.py from class.
The typical hello world program written in python.  The print function will output to the standard output i.e. the terminal output

#+begin_src python :results output
  print("Hello Python Programmers")
#+end_src

#+RESULTS:
: Hello Python Programmers

** Interactive Terminal

You can open a terminal (command prompt) and run "python".  This will pull you into the python interactive mode.  You will be able to run python code interactively.

** Back to the file

#+begin_src python
  print("Hello Python Programmers")
  print("My name is Matthew Yackiel")
#+end_src

#+RESULTS[e81c7ceea7f91ae0ed3c42d4fc9933d01ed743f2]:
: None

This is the output when run from the terminal.  Be sure to navigate to the location of your .py file before running "python <name of file>"

#+RESULTS:
: Hello Python Programmers
: My name is Matthew Yackiel

** Executing from a text editor
You can also use any type of text editor to write code files.  That is all programs are, just text that gets interpreted by the language(python).  Pycharm does the same thing just with alot of extra bells and wistles.

#+begin_src python
  print("Hello")
#+end_src

#+RESULTS[e49a9dd31026e9d45573c7c1091fbd2e0bc248f2]:
: None

** Some exercises with Pycharm
#+begin_src python :results output :tangle ./Module_1/Lectures.py
  print("-----------------------------------")
  print(" this is a python programming class")
  print("-----------------------------------")
#+end_src

#+RESULTS[2313e4a2b7126db6e5b875585a15882806903762]:
: -----------------------------------
:  this is a python programming class
: -----------------------------------

** Comments
Comments are lines in your program that are not read at all by the language.  They are preceded by the '#' character.  Use these to write notes about different parts of your program to organize your thoughts so that when you return to them after a break from work you can still read what you were writing.  More importantly they are used to document your code to that others can read them

#+begin_src python :tangle ./Module_1/Lectures.py
# variable: is a container that holds values
#+end_src

#+RESULTS[176eebd4cbe99a8b3d2829f2b8597926781b4084]:

Below is a docstring comment. It is used in the beginning of a program to document the program.  Can be used for multiline comments.


#+begin_src python
  '''
    This is a block Comment
    It is Multiple lines
    Yay look at me go
    She
    Sells
    Sea
    Shells
    by
    the
    Sea
    Shore
  '''
#+end_src

** Variables
:PROPERTIES:
:header-args: :results output :tangle ./Module_1/Lectures.py
:END:
Variables are a structure that contains data.  Each value has a type that is assigned when you first assign it a value.  ex.

*** Integer Values

#+begin_src python 
x = 100 # numeric value
# display the variable
print(x)
#+end_src

#+RESULTS[a774b545e2068a57e00a45b73b03cb75e0fb83c2]:
: 100

*** Integer operators

#+begin_src python
  # + operator is used with numbers to perform summation
  print(195 + 61)
#+end_src

#+RESULTS:
: 256

*** String Values

Text is enclosed in a pair of single OR double quotes.  This seperates String Values from code structures.

#+begin_src python 
# Example in double quotes 
y = "Hello"
print(y)
# Example in single quotes
z = "Mahmoud"
print(z)
#+end_src

#+RESULTS:
: Hello
: Mahmoud

**** String Concatenation
#+begin_src python
  # + operator is used to concatenate 2 strings
  first_name = "Mahmoud"
  last_name = "Darwich"
  print(first_name + " " + last_name)
  initial =" K "
  print(first_name + initial + last_name)
  print(first_name + " L " + last_name)

  # using + operator with a string and a number, is illegal
  mother = "Christi is"
  # print(mother + 45) is illegal
#+end_src

#+RESULTS:
: Mahmoud Darwich
: Mahmoud K Darwich
: Mahmoud L Darwich

**** Print strings with other types
We use commas to seperate different types in the print function

#+begin_src python
  # if it is required to combine a string with a number
  # the above is fixed with
  print(mother, 45, "years old")
#+end_src

#+RESULTS:

*** Variable Naming Convention
#+begin_src python
  name="Mahmoud"
  Name='Laura'
  NAME='Lisa'  # these are all valid unique variables
  # variabls name should be started with letters or _ only
  # variables cannot be started with numbers
  # variables should contain only letters, numbers, and _

  # 8name="Darwich" is illegal, cannot start with number
  _name = "Chris" # is legal
  cat24 = "Mikky" # is legal
  # first name = "Joe" spaces are illegal
  # # first-name = "Robert" is illegal no hyphen
 #+end_src

 #+RESULTS:

*** Assigning Multiple Variables in one statement

#+begin_src python
  # Assigning multiple values to variables in one statement
  Fruit1 = Fruit2 = Fruit3 = "Apple", "Orange", "Banana"
  print(Fruit1)
  print(Fruit2)
  print(Fruit3)
#+end_src

#+RESULTS:
: ('Apple', 'Orange', 'Banana')
: ('Apple', 'Orange', 'Banana')
: ('Apple', 'Orange', 'Banana')

**** Similarly Assign 1 value to multiple variables

#+begin_src python
  # assign on single value to multiple variables
  fruit4 = fruit5 = fruit6 = "Kiwi"
  print(fruit5)
#+end_src

#+RESULTS:
: Kiwi

** Errors
:PROPERTIES:
:header-args: :results output :tangle ./Module_1/Lectures.py
:END:
*** Syntax Errors
These are easy to catch errors as they are highlighted by PyCharm.  Look for Red (in light theme) underlines for errors.

#+begin_src python
# Example: 100x = 250 syntax error because the variable names start with a number. it generates red underline
#+end_src

*** Runtime Errors
These errors are found after you execute a file.  It will appear in the output as a Traceback error with an explanation of the error type at the bottom of the error.

#+begin_src python
# Example: print(100/0) this is a mathematical impossibility, we cannot divide numbers by 0
#+end_src

*** Logical Errors
This is the most difficult to find.  Pycharm cannot help you with this (OUTSIDE OF THE DEBUGGER WHICH IS TOO ADNAVCED FOR THIS COURSE).  This is found when you get results from your program that are valid, however they are unexpected/incorrect results.

#+begin_src python 
  # add 45 + 5 and then divide by 5.
  print(45+5/ 10)
  # python takes order of operations very literally.  follow PEMDAS
  print((45+5)/10)
#+end_src

#+RESULTS[160206fcf99dbc80921f9ed1ba87278f2bd46f68]:
: 45.5
: 5.0

** Input
:PROPERTIES:
:header-args: :results output :tangle ./Module_1/Lectures.py
:END:
*** The input function
This function will ask the user for input allowing interactive input.

#+begin_src python :results silent
  # input() is a function used to get space seperated values from the user from the keyboard (always returns the value as a string)
  get_input = input("Enter your name")
r
  print("get_input is:", get_input)
#+end_src

**** Entering Non-Stings
 The input function always assumes we are typing in a string. So if we want to get number values only we must wrap the input() function in the int() function
#+begin_src python
'''
  number1 = input("Enter a number")
  number2 = input("Enter another number")
  # add number1 and number2
  print(number1 + number2) # this will output 55 because number1 and number2 are strings returned by the input function
'''
  # add number1 to number 2 properly
  # the int function is used to convert the string from input to a number
  number1 = int(input("Enter a number"))
  number2 = int(input("Enter another number"))
  print(number1 + number2)
#+end_src

** Module 1 Practice Exercises
#+begin_src python :tangle ./Module_1/practice_exercise.py
  '''
  Matthew Yackiel
  Python 115
  Module 1 Exercises
  '''

#+end_src

#+begin_src python :tangle ./Module_1/practice_exercise.py :results output
  # question 1
  print("Welcome to Python")
  print("Welcome to Computer Science")
  print("Programming is fun\n")

  # question 2
  print("Welcome to Python\n"*5)

  # question 3
  print("a\t a^2\t a^3")
  print(1,"\t",1**2,"\t",1**3)
  print(2,"\t",2**2,"\t",2**3)
  print(3,"\t",3**2,"\t",3**3)
  print(4,"\t",4**2,"\t",4**3,"\n")

  # question 4
  print((9.5*4.5-2.5*3)/(45.5-3.5),"\n")

  # question 5
  PI = 3.14
  area = 5.5**2*PI
  perimeter = 5.5*PI*2
  print("area =", area)
  print("area =", perimeter)

  print()

  # question 6
  width = 4.5
  height = 7.9
  area = width * height
  perimeter = 2 * (width + height)
  print("area =", area)
  print("perimeter =", perimeter)

  print()

  # question 7
  kilometers = 14
  minutes = 45.5
  mph = (kilometers/1.6)/(minutes/60)
  print("Speed in mph ", round(mph, 3))

#+end_src

#+RESULTS[e233244f7fcb0a4942fa3121344e37aa5195e9f6]:
#+begin_example
Welcome to Python
Welcome to Computer Science
Programming is fun

Welcome to Python
Welcome to Python
Welcome to Python
Welcome to Python
Welcome to Python

a	 a^2	 a^3
1 	 1 	 1
2 	 4 	 8
3 	 9 	 27
4 	 16 	 64 

0.8392857142857143 

area = 94.985
area = 34.54

area = 35.550000000000004
perimeter = 24.8

Speed in mph  11.538
#+end_example


* Module 2 : Data Types
:PROPERTIES:
:header-args: :tangle ./Module_2/lecture.py
:END:
** Identify Data Types
#+begin_src python
  # to identify any data type, you can use a function type()
  x = 100
  print("The type of x is:", type(x))
  y = 100.56
  print("The type of x is:", type(y))
#+end_src

#+RESULTS:
: The type of x is: <class 'int'>
: The type of x is: <class 'float'>

** Numeric Types
*** Integer
Any positive or negative number of infinite length
#+begin_src python
  # example of integer
  m = -238947020934
  print(type(m))
#+end_src

#+RESULTS:
: <class 'int'>

*** float
#+begin_src python
  # example of a float number (rational number)
  n = 35.239847
  print(type(n))
#+end_src

#+RESULTS:
: <class 'float'>

*** Complex
Complex numbers in the complex name of the form (real +- real * complex)
#+begin_src python
  # example of complex numbers
  z = 1 + 100j
  print(type(z))
#+end_src

#+RESULTS:
: <class 'complex'>

#+begin_src python
num4 = 45 + 10j # j is the imaginary part
#+end_src

#+RESULTS:

*** Scientific Notation
Numbers can be written in scientific notation as follows
#+begin_src python
  num1 = 145e5 # 145*10^5
  print(num1)

  num2 = 3.4567
  num3 = 34567e-4
  print(num3)
#+end_src

#+RESULTS:
: 14500000.0
: 3.4567

*** Converting Between Numerical Types
Convert a number, use function int(), float(), and complex()   NOTE: COMPLEX CANNOT BE CONVERTED TO FLOAT OR INT
#+begin_src python
  num5 = 14.67
  # convert to integer
  print(int(num5))
  num6 = 178
  #convert to float
  print(float(num6))
  #convert num5 and num6 to complex
  print(complex(num5))
  print(complex(num6))
  num7 = 23 + 65j
  # converting to int of float produces an error
  #print(int(num7))
#+end_src

#+RESULTS:
: 14
: 178.0
: (14.67+0j)
: (178+0j)

*** Alternate Number Systems
#+begin_src python
  # decimal numbers are 0 to 9
  # binary numbers are 0 and 1 only
  # Octal numbers are 0 to 7
  # Hexadecimal numbers are 0 - 9 and then A - F
  # to represent a binary number we preceed the number by 0b
  # to represent an octal number we preceed the number by 0o
  # to represent a hexadecimal number we preceed the number hy 0x
  num9 = 0b1110111
  print(num9) # this will print the binary number in a decimal form
  num10 = 0o1763
  print(num10)
  num11 = 0xABEF1
  print(num11)

  number1 = 755
  # convert decimal to binary, use bin() function
  num12 = bin(number1)
  print(num12)
  # convert decimal number to octal use oct() function
  num13 = oct(number1)
  print(num14)
  # convert decimal number to hexadecimal, use hex() function
  # example number2=ox12ac56, convert it to an octal number
  number2 = 0x12ac56
  print(oct(number2))
  # convert number 2 to a binary number
  print(bin(number2))
  # convert number 2 to a decimal number
  print(number2)
 #+end_src

 #+RESULTS:

*** Numeric Operators
**** Floor Division
#+begin_src python
  # floor division, it removes desimal precision from the numbers
  num14 = 111//10
  print(num14)
#+end_src

#+RESULTS:
: 11

**** Modulus
#+begin_src python
  # modulus computes the remainder of the division between 2 number, and is represented by %
  num15 = 111 % 6
  print(num15)
  print(10 % 4)
#+end_src

#+RESULTS:
: 3
: 2

**** Absolute Value
#+begin_src python
  # abs() returns positive numbers
  print(abs(-1553))
#+end_src

#+RESULTS:
: 1553

**** Divmod
#+begin_src python
  # returns the qutient and remainder of the division between 2 numbers
  divmod(120, 6)
#+end_src

#+RESULTS:

*** Assignment Operator Variants
**** additive assignment
#+begin_src python
  # += assignment operator, increment the number by a value
  num15 = 100
  num15 += 1
  print(num15)
#+end_src

#+RESULTS:
: 101

**** subtractive assignment
#+begin_src python
  # decrementing num15 by 5: num15 -= 5
  num16 = 200
  num16 -= 5 # num16= num16 - 5
  print(num16)
#+end_src

#+RESULTS:
: 195

**** multiplicative assignment
#+begin_src python
  # multiplicative assignment
  num17 = 2
  num17 *= 3
  print(num17)

  # power assignment
  num18 = 4
  num18 **= 3
  print(num18)
#+end_src

#+RESULTS:
: 6
: 64

**** quotient assignment
#+begin_src python
  # quotient assignment
  num20 = 10
  num20 /= 5
  print(num20)
#+end_src

#+RESULTS:
: 2.0

** Strings
*** String Literals
#+begin_src python :tangle no
str1 = 'Bloomsburg University of Pennsylvania'
#+end_src

#+RESULTS:

*** Indexing
To access a string use [ start index : end index ]
#+begin_src python
  str1 = "Bloomsburg University of Pennsylvania"
  # access the string index 0 to 6
  print(str1[0:6])
  # access the characters starting at index 6 and ending at index 15
  print(str1[6:15])
  # display the first 20 characters
  print(str1[:20])
  # some equivalent statements
  print(str1[:])
  print(str1)
  # displaying of string characters starting from the end of the string, we use negative indices
  print(str1[-5:]) # last 5 characters
  # display the characters at index 1 from the end
  print(str1[-12:-1])
#+end_src

#+RESULTS:
: Blooms
: burg Univ
: Bloomsburg Universit
: Bloomsburg University of Pennsylvania
: Bloomsburg University of Pennsylvania
: vania
: Pennsylvani

*** Length of a String
#+begin_src python
# to count the characters of a string, we apply the length function len()
str2="Bloomsburg University! of Pennsylvania"
# get the length of the string
getLength= len(str2)
print("the length of the str2 is ", getLength)
#+end_src

#+RESULTS:
: the length of the str2 is  38

