Summer_2021/Python_115/README.org
*** Strip
#+begin_src python
# strip() function is used to remove the white spaces from the beginning and the end of a string
str3=" Hello Python Progammers "
print("The first character is ", str3[0])
# apply strip() function
str4=str3.strip()
print(" the first character or letter in the string str4 is ", str4[0])
#+end_src

#+RESULTS:
: The first character is   
:  the first character or letter in the string str4 is  H

*** Convert to upper or lower case
#+begin_src python :eval none
str5="BLOOMSBURG UNISVERSITY"
# convert upper case letters to lower case letter, low() is applied on the string
str6=str5.lower()
print(str6)
# to convert lower case letters to upper case letters, we apply upper() function
print(str2.upper())
#+end_src

#+RESULTS:

*** Replace Characters
#+begin_src python
# replace("old character", "new character") function replaces old character with a new character
# exercise replace the character "o" in str2 by a character "D"
print(str2.replace("o", "G"))
# replace Bloomsburg by Bloom
print(str2.replace("Bloomsburg", "Bloom"))
#+end_src
*** Split Strings
#+begin_src python
# split() split the string into substrings
print(str2.split())
# split the string based on a specific character
print(str2.split("!"))
# split  str2 when it finds character "y"
print(str2.split("y"))
#+end_src

#+RESULTS:

*** In operator
#+begin_src python
# in operator is used to search a string
searchStr="Bloom "  not in str2
print(searchStr)
#+end_src
*** Format Function
#+begin_src python
print("COMPSCI 115" + " "+ "is a Python Progamming course")
str7="{} COMPSCI "
num16= 115
# print(str7+num16) this will cause an error because we cannot concatenate a string with an integer
# in this case we apply a format() function, place {} where you want to add the number to the string
print(str7.format(num16))
str8= "COMPSCI {1}  is given in Fall {0}  and Spring {2}  "
courseNum=115
year1= 2021
year2=2022
print(str8.format(year1, courseNum, year2)) # year1 argument is at position 0, courseNum is at position 1 and year2 is at position2
#+end_src
** Logical Operators

#+begin_src python
  x = 100 # we assign 100 to a variable x
  x==100 # x is equal to 100
  # Comparison operators
  # < less than
  # > great than
  # < = less than or equal
  # >= greater than or equal
  # == equal
  # Boolean data type has only two values False and True only
  print(" the comparison of the values returns ",1000 != 1500)
#+end_src

** Practice Exercise
#+begin_src python
p# Question 1
# getting the input form the user and converting it to an integer
"""
for i in range(3):
    num= int(input("Enter an integer: "))
    print(num, " in the binary system is ", bin(num))
# convert the integer to a binary
"""

"""
# Question 2
# getting float values from the users and convert them to integers
floatNumber=float(input("Enter a float Number: "))

#convert FloatNumber to an integer
integerNumber= int(floatNumber)
print(floatNumber, " is  ",integerNumber, " as an integer")
"""

# Question 3
# a) create a variable and get the length of the string
string1="Department of Mathematical and Digital Sciences, Bloomsburg University of Pennsylvania"
print("the length of the string1 is ",len(string1), " characters")
# b) display characters between indices 10 and 30
print("the characters between indices 10 and 30 are:\n", string1[10:30])
print("the lower case letters of the string are as follow: \n", string1.lower())
# c) display all characters in upper case
print(" the upper case letters of the string are as follow: \n", string1.upper())
# d) replace letter "e" by letter "O"
print("we replace letter \"e\" by letter \"O\": \n ", string1.replace("e","O"))

# Question 4
string2="Bloomsburg University of Pennsylvania was established as Bloomsburg Academy in {}. In {}  it was renamed {}Bloomsburg Literary Institute {}"
year1=1839
year2=1856
year3=1990
print(string2.format(year1, year1, year1, year2 ))
# Question 5
# calculate the surface area of a cube
# get the side length from the user
side= input("enter the side length of a cube ")
for i in side:
    if i==".":
        decimalPoint=side.index(".")
        print(" the index of decimal is ", decimalPoint)
        while len(side[decimalPoint+1:])>2:
            side = input(" enter again the side length of a cube and you should use 2 digits after decimal point ")
            if len(side[decimalPoint+1:])<2:
                break;


floatinput=float(side)

area = pow(floatinput, 2)
surface = 6 * area
print(" the total surface areas of a cube of edge length", side, " is ", round(surface, 2))

#  area of one side
#area= pow(side,2)
# surface of the cube
#+end_src

* Module 3: Control Statements
:PROPERTIES:
:header-args: :tangle ./Module_3/lecture.py 
:END:
** If Statements
#+begin_src python :eval no
# if control  statement

num1 = 8
num2 = 8
if num1 > num2:
    print(" this is true 9>8")
    print(" that's great!")
# if the condition of the if statement is not true, then I want my program to go in another direction, in this case we use elif statement
elif num1 < num2:
    print( num1, " is less than ", num2)
elif num1==num2:
    print(num1, " is equal to ", num2)
print(" the program execution is completed!")

# else conditional statement is used  if none of the above conditions work
num3 =int(input(" Enter the first number >>>> "))
num4 =int(input(" Enter the second number >>>>"))
if num3 < num4:
    print(num3,"  is less than", num4)
elif num3> num4:
    print(num3,"  is greater than", num4  )
else:
    print(" both", num3,  num4,  " are  equals")

num5=600
num6=700
if num5<num6: print(" num5 is less than num6")

# shorthand for if ... else statement

num7=100
num8= 170
print( num7, "is less than ", num8) if num7< num8 else print(num7,"is not less than  ",num8)
#+end_src

#+RESULTS:

** Iteration
#+begin_src python :eval none
# while loop to execute the statements many times through iterations as long as the condition true
# you need to create a counter and initiliaze it

i=0
while i <50:

    print(" Hello Programmers", " at iteration", i)
    i+=7 #  this means i=i-7

# break statement is used to stop the while loop execution even the condition still

j=-1
while j<50:
    j+=1
    if j==10:
        break
    print(j)

# for loop is used to iterate a block of codes, you dont need to use any counter
print()
list =(2,5,6,8,9,10)
for i in list:
    print(i) # i represent each character in the string

for i in range(10):
    print("Hello Programmers at iteration", i)

inputNumber=input(" Enter a float number and make sure to take two digits after decimal points: ")
for i in inputNumber:
    if i==".":
        decimalPoint=inputNumber.index(i)
        while len(inputNumber[decimalPoint+1:])>2:
            inputNumber=input("try again to enter two digits after decimal point")
            if len(inputNumber[decimalPoint+1:])<2:
                break

print(float(inputNumber))
#+end_src

#+RESULTS:

** Iteration Continued
:PROPERTIES:
:header-args: :tangle ./Module_3/lecture_part2.py
:END:
#+begin_src python
  num1= 2
  while num1>5:
      print(" hello Programmers")

  # continue statement is used with an If statement within a loop to skip a particular iteration

  # range() function generates  numbers between range of values example range(10); this will generates numbers between 0 and 9
  """
  x= -1
  while x<9:
      x = x + 1
      if x>=3 and x<=7: # is the same if we 3<=x<=7
          continue
      print(" the value of counter is  ", x)
  """
  #break statement is used to break the loop even the condition is true
  # break the loop at iteration 5
  y=-1
  while y<20:
      y+=1
      if y==10:
          break
      print(y)
  else:
      print(" the loop is over")
  # you can use else statement with while loop
  # for variablename  in Valuesrange
  str1="Bloomsburg University"
  for x in str1:
      print(x)

  # use for loop with numeric values
  for  i in range(100):
      print("COMPSCI 115 at iteration", i)

  print()
  m=-1
  while m<99:
      m+=1
      print("COMPSCI 115 at iteration", m)

  # range() function could up to three arguments
  # range(oneValue), it will generate numbers between 0 and oneValue excluding oneValue
  # range(start, end) function receives two arguments, start value is the starting value of the range and end is the end value of the range
  # example generate numbers between 50 and 100
  print()
  for  num3 in range(50,101):
      print(num3)

  # if you want the step between numbers in the range(), you need add three arguments
  for num4 in range(1000, 1200, 8):
      print(num4)
  # nested for loops: we have two loops, one inside the other
  color=["White","Black", "Blue"]
  car=["Honda", "BMW", "Mercedes"]
  for x in color:
      for y in car:
          print(x,y)

  for s in range(80):
      if s==50:
          continue
      print(s)
  # example show all values between 0 and 80 except odd values (i.e. display even values)
  # dislay even number between 0 and 10
  for j in range(10):
      if (j%2!=0):
          print(j," is an odd")


  # display even numbers
  for k in range(80):
      if k%2!=0:
          continue
      print(k," is an even number")
  # display odd numbers
  for l in range(80):
      if l%2==0:
          continue
      print(l," is an odd number")
#+end_src

#+RESULTS:
: None


* Module 4: Functions
:PROPERTIES:
:header-args: :result output :tangle ./Module_4/lecture.py :comments link
:END:
** What is a funciton?
#+begin_src python

  """
  Module 4  function
  this is the third week
  COMPSCI 115
  """
  # function is a block of codes that does a specific taks, a function  cannot be executed unless it is invoked (called)

  # create a function
  def displayInfo():
      print("The course is Python Programming COMPSCI 115")
      print("Summer 2021")

  # when executing the codes, nothing will happen, you need to call the function in order the execute the bfunction's body

  # Call a function to execute the statements in its body
  # just use the function name followed by parentheses
  displayInfo()

#+end_src

*** Example
#+begin_src python

  def averageNumber():
      x=78
      y=90
      z=177
      sum=78+90+177
      # compute the average
      average=sum/3

      print("The average is ", average)

  # call the function
  averageNumber()
#+end_src

** Passing Arguments
#+begin_src python

  # arguments are values to be passed to a function in order to be used in its body
  # parameters is variable used in the function when it is created
  def multiplyNumbers(num1,num2, num3, num4): # num1 and num2 are variables and they are called parameters
      print("The multiplication of the two numbers is ", num1*num2)
      print(" the summation of ",num3, " and ", num4, " is ", num3+num4)

  multiplyNumbers(45,89, 109,980) # 45 and 89 are called arguments
  multiplyNumbers(100,200, 177,650)

#+end_src

*** Example
#+begin_src python

  # create function
  def displayName(firstName, lastName):
      print(firstName, lastName)

  displayName("Mahmoud","Darwich")
  displayName("Robert", "Smith")
  str1="Bloomsburg University".upper()
  #return keyword used to return results from a calling function
  def sumNumbers(num5, num6):
      sum=num5+num6
      #print("the sum of num5 and num6",sum)
     # return  sum

  #summation=sumNumbers(300,1500) # the returned results is 1800
  #print(" the sum is ", sumNumbers(300,1500))
  #x1 =sumNumbers(1,4)*4
  #print(x1)
  sumNumbers(15,5)
  #print(variable1)
  print(sumNumbers(20,40))
  def displaySummation():
      num7=sumNumbers(150,60)
      print(" the summation is ", num7)
  displaySummation()
#+end_src

