Summer_2021/Python_115/Module_4/lecture.py
# [[file:../README.org::*What is a funciton?][What is a funciton?:1]]
"""
Module 4  function
this is the third week
COMPSCI 115
"""
# function is a block of codes that does a specific taks, a function  cannot be executed unless it is invoked (called)

# create a function
def displayInfo():
    print("The course is Python Programming COMPSCI 115")
    print("Summer 2021")

# when executing the codes, nothing will happen, you need to call the function in order the execute the bfunction's body

# Call a function to execute the statements in its body
# just use the function name followed by parentheses
displayInfo()
# What is a funciton?:1 ends here

# [[file:../README.org::*Example][Example:1]]
def averageNumber():
    x=78
    y=90
    z=177
    sum=78+90+177
    # compute the average
    average=sum/3

    print("The average is ", average)

# call the function
averageNumber()
# Example:1 ends here

# [[file:../README.org::*Passing Arguments][Passing Arguments:1]]
# arguments are values to be passed to a function in order to be used in its body
# parameters is variable used in the function when it is created
def multiplyNumbers(num1,num2, num3, num4): # num1 and num2 are variables and they are called parameters
    print("The multiplication of the two numbers is ", num1*num2)
    print(" the summation of ",num3, " and ", num4, " is ", num3+num4)

multiplyNumbers(45,89, 109,980) # 45 and 89 are called arguments
multiplyNumbers(100,200, 177,650)
# Passing Arguments:1 ends here

# [[file:../README.org::*Example][Example:1]]
# create function
def displayName(firstName, lastName):
    print(firstName, lastName)

displayName("Mahmoud","Darwich")
displayName("Robert", "Smith")
str1="Bloomsburg University".upper()
#return keyword used to return results from a calling function
def sumNumbers(num5, num6):
    sum=num5+num6
    #print("the sum of num5 and num6",sum)
   # return  sum

#summation=sumNumbers(300,1500) # the returned results is 1800
#print(" the sum is ", sumNumbers(300,1500))
#x1 =sumNumbers(1,4)*4
#print(x1)
sumNumbers(15,5)
#print(variable1)
print(sumNumbers(20,40))
def displaySummation():
    num7=sumNumbers(150,60)
    print(" the summation is ", num7)
displaySummation()
